# Cask: install binaries
tap 'caskroom/cask'

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'
tap 'homebrew/core'
tap 'homebrew/versions'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'

brew 'brew-cask'
brew 'rcm'
brew 'emacs', args: ['with-cocoa']
brew 'vim'
brew 'sbcl' # Common Lisp, Steel Bank Common Lisp
brew 'hub' # github
brew 'battery'
brew 'jq' # sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew 'the_silver_searcher' # a better ack/grep
brew 'fzf' # fuzzy finder
brew 'shellcheck' # Check shell scripts
brew 'aspell'
brew 'awscli'
brew 'bash-completion'
brew 'icu4c'
brew 'erlang'
brew 'go'
brew 'openssl'
brew 'sqlite'
brew 'python'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'perl'
brew 'rabbitmq'
brew 'redis'
brew 'tree'
brew 'wget'
brew 'bash-completion'
brew 'pdfgrep'

cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'google-chrome'
cask 'vlc'
cask 'filezilla'
cask 'firefox'
cask 'evernote'
cask 'iterm2'
cask 'postman'
cask 'dockertoolbox'
cask 'virtualbox'
cask 'vagrant'
cask 'tunnelblick'
cask 'slack'
cask 'sizeup'
cask 'screenhero'
cask 'sequel-pro'
cask '1password'
cask 'skype'
