# frozen_string_literal: true

tap 'aws/tap'

tap 'codeclimate/formulae'
tap 'goles/battery'
tap 'homebrew/services'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'instantclienttap/instantclient'
tap 'thoughtbot/formulae'
brew 'aspell'
brew 'autoconf'
brew 'automake'
brew 'openssl@1.1'
brew 'readline'
brew 'sqlite'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'battery'
brew 'bfg'
brew 'freetype'
brew 'pcre'
brew 'python'
brew 'chamber'
brew 'coreutils'
brew 'ctags'
brew 'go'
brew 'dep'
brew 'erlang'
brew 'freetype'
brew 'elixir'
brew 'findutils'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'pkg-config'
brew 'graphviz'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'icu4c'
brew 'libtool'
brew 'imagemagick'
brew 'jmeter'
brew 'jq'
brew 'libksba'
brew 'libressl'
brew 'mysql'
brew 'libyaml'
brew 'mysql', link: false
brew 'mysql@5.7', link: true
brew 'nvm'
brew 'openconnect'
brew 'openssl'
brew 'openvpn'
brew 'pcre'
brew 'pdfgrep'
brew 'perl'
brew 'php-code-sniffer'
brew 'postgresql'
brew 'protobuf'
brew 'putty'
brew 'pyenv'
brew 'rcm'
brew 'readline'
brew 'rbspy'
brew 'reattach-to-user-namespace'
brew 'rustup'
brew 'redis'
brew 'rustup-init'
brew 'sbcl'
brew 'shellcheck'
brew 'sqlite'
brew 'siege'
brew 'telnet'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tnftp'
brew 'tree'
brew 'uchardet'
brew 'unixodbc'
brew 'vim'
brew 'wget'
brew 'zlib'
brew 'aws/tap/aws-sam-cli'
brew 'codeclimate/formulae/codeclimate'
brew 'goles/battery/battery'
brew 'instantclienttap/instantclient/instantclient-basic'
brew 'instantclienttap/instantclient/instantclient-sdk'
brew 'instantclienttap/instantclient/instantclient-sqlplus'
brew 'thoughtbot/formulae/rcm'
cask '1password'
cask 'alfred'
cask 'aviatrix-vpn-client'
cask 'cyberduck'
cask 'dash'
cask 'datagrip'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'evernote'
cask 'filezilla'
cask 'firefox'
cask 'font-fantasque-sans-mono'
cask 'font-fira-code'
cask 'github'
cask 'google-chrome'
cask 'java'
cask 'krisp'
cask 'microsoft-edge'
cask 'microsoft-remote-desktop-beta'
cask 'ngrok'
cask 'postman'
cask 'psequel'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sizeup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'suspicious-package'
cask 'tunnelblick'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'wkhtmltopdf'
