# frozen_string_literal: true

# Cask: install binaries
tap 'caskroom/cask'

# Lets us do `brew services restart postgres`, etc
tap 'homebrew/services'
tap 'homebrew/core'
tap 'homebrew/versions'

# thoughtbot stuff like rcm
tap 'thoughtbot/formulae'

tap 'Goles/battery'
tap 'caskroom/fonts'

brew 'aspell'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'battery'
brew 'ctags'
brew 'erlang'
brew 'freetype'
brew 'fzf' # fuzzy finder
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'htop'
brew 'hub' # github
brew 'icu4c'
brew 'jq' # sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew 'libressl'
brew 'mysql'
brew 'node'
brew 'nvm'
brew 'openconnect'
brew 'openssl'
brew 'openvpn'
brew 'pcre'
brew 'pdfgrep'
brew 'perl'
brew 'protobuf'
brew 'pyenv'
brew 'rcm'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rustup'
brew 'sbcl' # Common Lisp, Steel Bank Common Lisp
brew 'shellcheck' # Check shell scripts
brew 'sqlite'
brew 'the_silver_searcher' # a better ack/grep
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'

cask '1password'
cask 'alfred'
cask 'cyberduck'
cask 'dash'
cask 'datagrip'
cask 'dbvisualizer'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'filezilla'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'postman'
cask 'psequel'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sizeup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'tunnelblick'
cask 'tuntap'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'wkhtmltopdf'
